export default {
  navbar: {
    about: 'Про нас',
    priorities: 'Пріоритети',
    mission: 'Місія',
    projects: 'Проекти',
    partners: 'Партнери',
    news: 'Новини',
    contact: 'Контакт',
    foundation: 'Фундація'
  },
  heroTitleLines: [
    'МИ ПОЄДНУЄМО НАУКУ,',
    'ОСВІТУ ТА СОЦІАЛЬНУ',
    'СОЛІДАРНІСТЬ ЗАРАДИ',
    'МІЖНАРОДНОГО',
    'ДІАЛОГУ'
  ],
  heroButton: 'КОНТАКТ',
  heroDownload: 'ЗАВАНТАЖИТИ НАШ СТАТУТ (PDF)',


  priorities: {
    title: 'Пріоритети на 2025 рік',
    intro: 'Цьогорічна діяльність зосереджена на підтримці громадян України, які постраждали від війни.',
    what: 'Що?',
    who: 'Хто?',
    why: 'Чому?',
    items: [
      {
        area: 'Інтеграційна освіта',
        what: 'Гібридні курси польської мови, адаптаційні майстер-класи, наставництво',
        who: 'Вимушені мігранти в Польщі',
        why: 'Полегшення професійного та соціального старту'
      },
      {
        area: 'Промоція польської культури та науки',
        what: 'Навчальні візити «Полум’я надії» у Гданську',
        who: 'Молодь з України (14–18 років)',
        why: 'Формування позитивних відносин та заохочення до навчання у Польщі'
      },
      {
        area: 'Наукова співпраця',
        what: 'Дослідницькі стажування, семінари та публікації',
        who: 'Науковці з України',
        why: 'Передача знань, спільні дослідницькі проекти'
      },
    ]
  },

  projects: [
  {
    id: 'uniwersytet',
    title: 'Цикл наукових вебінарів для молодих дослідників',
    description: 'Онлайн-програма, що підтримує розвиток наукових і публікаційних компетенцій молодих дослідників.',
    image: '/images/project1.jpg',
    desc: `Освітня ініціатива, спрямована на молодих науковців і аспірантів, пропонує дистанційні заняття польською, англійською та російською мовами. Програма має на меті розвиток дослідницьких навичок і проводиться досвідченими викладачами Гданського університету. Цикл вебінарів є формою практичної академічної освіти, яка дає змогу учасникам дізнатися про специфіку публікацій у журналах, індексованих у базах Scopus та Web of Science, розвивати науковий інструментарій і формувати мережу міжнародного співробітництва.`,
    cta: 'Невдовзі доступно',
  },
  {
    id: 'staze',
    title: 'Наукові стажування в Гданську',
    description: 'Дослідницька програма з менторською підтримкою для молодих науковців із країн Східного партнерства.',
    image: '/images/project3.jpg',
    desc: `Програма оплачуваних стажувань для молодих науковців і студентів із країн Східного партнерства, яка дає можливість проводити дослідження та набувати досвіду в академічних і міських установах Гданська. Стажування доповнюються навчальними візитами, щоб краще зрозуміти механізми функціонування сучасних місцевих громад.  
    Метою програми є підтримка розвитку академічної кар’єри та створення довгострокових зв’язків між науковими спільнотами Польщі й України.`,
    cta: 'Невдовзі доступно',
  },
],

  partners: {
    title: 'Партнери',
    strategic: [
      { name: 'Місто Гданськ', logo: '/images/gd.png' },
      { name: 'Метрополітальний Інститут', logo: '/images/partners/metropolitalny.png' },
      { name: 'Гданський Університет', logo: '/images/ug.png' }
    ],
    network: [
      { name: 'Мігрантські НУО', logo: '/images/ngo.jpg' },
      { name: 'Школи', logo: '/images/partners/szkoly.png' },
      { name: 'Бібліотеки', logo: '/images/partners/biblioteki.png' }
    ]
  },

  mission: {
    title: 'Наша місія',
    motto: 'Ми поєднуємо науку, освіту та соціальну солідарність задля міжнародного діалогу.',
    goals: [
      {
        title: 'Дослідження та розвиток науки',
        description: 'Ми прагнемо підтримувати дослідження та проекти у сфері соціальних і гуманітарних наук, а також ефективне управління науковими фондами.',
        icon: 'FlaskConical'
      },
      {
        title: 'Підтримка освіти',
        description: 'Наша мета – підвищення якості навчання, розвиток освіти, виховання та компетенцій як у Польщі, так і за її межами.',
        icon: 'GraduationCap'
      },
      {
        title: 'Міжкультурний діалог',
        description: 'Ми прагнемо будувати дружні відносини між країнами шляхом розвитку соціальної дипломатії та культурного й мистецького обміну.',
        icon: 'Users'
      },
      {
        title: 'Міжнародна співпраця',
        description: 'Нам важливо розвивати співпрацю між освітніми закладами, організаціями, самоврядуваннями та партнерами з різних країн.',
        icon: 'Globe2'
      },
      {
        title: 'Промоція Польщі',
        description: 'Ми прагнемо поширювати польську мову, культуру, науку та спадщину системних реформ на міжнародній арені.',
        icon: 'Flag'
      },
      {
        title: 'Обмін досвідом',
        description: 'Ми хочемо ділитися польським досвідом європейської інтеграції та реформ – особливо з країнами Східного партнерства.',
        icon: 'Share2'
      },
      {
        title: 'Посилення громадянського суспільства',
        description: 'Наша місія – підтримувати самоврядування, громадянське суспільство, ринкову економіку та супутні реформи.',
        icon: 'Building'
      },
      {
        title: 'Підтримка для біженців і мігрантів',
        description: 'Ми прагнемо підтримувати біженців війни та мігрантів у їхній соціальній інтеграції та культурній адаптації в Польщі.',
        icon: 'HelpingHand'
      }
    ],

    values: [
      'Політична незалежність',
      'Культурне різноманіття',
      'Відкритість до співпраці',
      'Соціальна відповідальність'
    ]
  },

  board: {
  title: 'Члени правління',
  members: [
    {
      id: 'AK',
      name: 'д-р габ. Олександр Кучабський',
      photo: '/images/1.png',
      bio: 'Голова Ради Фонду — народився у Львові, пов’язаний з Гданським університетом, де працює професором у Відділі регіонального розвитку. Доктор габілітований наук про Землю у галузі географії (нострифікація ступеня доктора наук з державного управління, Україна), випускник Львівського державного університету ім. І. Франка та Національної школи публічного управління у Варшаві. Раніше обіймав керівні посади в органах державної влади та у вищій освіті в Україні, був стипендіатом програми ім. Лейна Кіркланда Польсько-Американської комісії Фулбрайта. Його наукові інтереси охоплюють державне управління, територіальні реформи та регіональний розвиток у Польщі та Україні. У діяльності Фонду поєднує науковий та адміністративний досвід, сприяючи обміну знаннями та кращими практиками між двома країнами.'
    },
    {
      id: 'OZ',
      name: 'д-р Ольга Задорожна',
      photo: '/images/2.png',
      bio: 'Президент Фонду — народилася в Харкові (Україна), нині проживає в Гданську. Випускниця та викладачка Харківського національного університету ім. В. Н. Каразіна, доктор економічних наук зі спеціальності теорія економіки та історія економічної думки, має звання доцента, членкиня Академії економічних наук України та Центру українсько-європейського наукового співробітництва. Поєднує професійний досвід із науковою та педагогічною діяльністю, зокрема у сфері світової економіки, національної економіки та соціальної відповідальності. Проходила науково-педагогічне стажування в Гданському університеті. У своїй діяльності керується ідеєю міжнародної співпраці та розвитку науки, заснованої на гуманістичних цінностях, вірить, що наука і духовна творчість можуть разом формувати сучасне громадянське суспільство.'
    },
    {
      id: 'PB',
      name: 'Патрик Блава́т',
      photo: '/images/patryk.png',
      bio: 'Координатор проєктів — засновник об’єднання «Wiatr od Morza» («Вітер з моря»), яке з 2021 року реалізує ініціативи в рамках громадського бюджету, організовує культурні події та популяризує знання про історію та ідентичність Гдині. З 2024 року — депутат району Гдиня Цисова, активно долучається до дій на користь сталого розвитку та громадської активності. Студент просторової економіки Гданського університету, поєднує пристрасть до міст із науковими дослідженнями їхнього майбутнього. У своїй роботі прагне поєднувати локальний досвід із довгостроковим баченням розвитку, розглядаючи просторове планування як форму відповідального проєктування соціального майбутнього.'
    },
    {
      id: 'DI',
      name: 'Домінік Ігельський',
      photo: '/images/dominik.jpeg',
      bio: 'Член Ради Фонду — народився в Дзялдово (Вармінсько-Мазурське воєводство). Випускник Гданського університету, магістр просторової економіки, нині працює у Відділі урбаністики та архітектури Міської адміністрації Гданська. Активна людина, яка прагне досконалості у своїх цілях і завданнях, вірить, що сильна та залучена спільнота — це ключ до успіху. Саме це вважає пріоритетом, беручи участь у діяльності Фонду.'
    },
  ]
},

  contact: {
    title: 'Контактна форма',
    name: 'Ім’я',
    surname: 'Прізвище',
    email: 'E-mail',
    phone: 'Телефон',
    topic: 'Тема',
    topicPlaceholder: 'Виберіть тему...',
    topicContact: 'Загальний контакт',
    topicProject: 'Заявка на проект',
    project: 'Виберіть проект',
    projectPlaceholder: 'Виберіть проект...',
    projectUni: 'Університет ІІІ Віку',
    projectPlomyk: 'Полум’я надії',
    projectIntern: 'Наукові стажування',
    message: 'Повідомлення',
    rodo1: 'Я погоджуюсь на обробку моїх персональних даних з метою контакту.',
    rodo2: 'Підтверджую ознайомлення з політикою конфіденційності.',
    submit: 'Надіслати',
    confirmation: 'Дякуємо за відправку форми!'
  },
  footer: {
    logoTitle: 'Фундація ISEF',
    logoText: 'INTERNATIONAL SCIENTIFIC AND EDUCATIONAL FORUM',
    contactTitle: 'Контактні дані',
    addressLabel: 'Адреса',
    address: 'вул. Яна Гевелія 11/811, 80-890 Гданськ',
    krs: '0001162327',
    nip: '5833533208',
    regon: '54121717200000',
    navTitle: 'Навігація',
    socialTitle: 'Ми в соцмережах',
    copy: 'Фундація. Усі права захищені.'
  },

  news: [
    {
      title: 'Культурні майстер-класи для молоді з України',
      text: '2 серпня 2025 року відбулися унікальні інтеграційні майстер-класи, у яких взяли участь понад 40 молодих людей з Польщі та України. Програма включала зустрічі з місцевими митцями, вивчення польської мови та творчі заняття. Завдяки підтримці партнерів вдалося створити простір для міжкультурного діалогу та побудови нових дружніх стосунків.',
      image: '/images/project1.jpg',
      date: '02.08.2025'
    },
    {
      title: 'Фундація розпочинає новий проєкт "Міст поколінь"',
      text: 'Проєкт "Міст поколінь" має на меті об’єднати старше покоління з молоддю через серію зустрічей, спільну творчу діяльність і майстер-класи. Урочисте відкриття відбулося 10 серпня 2025 року в Гданську. Учасники могли спробувати себе в живописі, фотографії та традиційних ремеслах. Це лише початок серії заходів, які проходитимуть щомісяця.',
      image: '/images/project1.jpg',
      date: '10.08.2025'
    },
    {
      title: 'Благодійний концерт на підтримку молодих талантів',
      text: '20 серпня 2025 року ми організували благодійний концерт у центрі Гданська, під час якого виступили молоді артисти з регіону. Усі зібрані кошти були спрямовані на стипендії для талановитої молоді з неблагополучних середовищ. Завдяки підтримці мешканців вдалося зібрати понад 50 000 злотих!',
      image: '/images/project1.jpg',
      date: '20.08.2025'
    }
  ]

}
