export default {
  navbar: {
    about: 'Про нас',
    priorities: 'Пріоритети',
    mission: 'Місія',
    projects: 'Проекти',
    partners: 'Партнери',
    news: 'Новини',
    contact: 'Контакт',
    foundation: 'Фундація'
  },
  heroTitleLines: [
    'МИ ПОЄДНУЄМО НАУКУ,',
    'ОСВІТУ ТА СОЦІАЛЬНУ',
    'СОЛІДАРНІСТЬ ЗАРАДИ',
    'МІЖНАРОДНОГО',
    'ДІАЛОГУ'
  ],
  heroButton: 'КОНТАКТ',

  priorities: {
    title: 'Пріоритети на 2025 рік',
    intro: 'Цьогорічна діяльність зосереджена на підтримці громадян України, які постраждали від війни.',
    what: 'Що?',
    who: 'Хто?',
    why: 'Чому?',
    items: [
      {
        area: 'Інтеграційна освіта',
        what: 'Гібридні курси польської мови, адаптаційні майстер-класи, наставництво',
        who: 'Вимушені мігранти в Польщі',
        why: 'Полегшення професійного та соціального старту'
      },
      {
        area: 'Промоція польської культури та науки',
        what: 'Навчальні візити «Полум’я надії» у Гданську',
        who: 'Молодь з України (14–18 років)',
        why: 'Формування позитивних відносин та заохочення до навчання у Польщі'
      },
      {
        area: 'Наукова співпраця',
        what: 'Дослідницькі стажування, семінари та публікації',
        who: 'Науковці з України',
        why: 'Передача знань, спільні дослідницькі проекти'
      },
    ]
  },

  projects: [
    {
      id: 'uniwersytet',
      title: 'Всеукраїнський Університет Третього Віку для українців',
      description: 'Освітня програма у гібридній формі, що підтримує розвиток та інтеграцію літніх людей з України.',
      image: '/images/project1.jpg',
      desc: `Освітня ініціатива для літніх людей українського походження, яка пропонує заняття у
      гібридній або дистанційній формі. Програма має на меті соціальну активізацію та міжпоколінну
      інтеграцію, а її реалізація передбачає співпрацю з місцевою владою, включаючи отримання
      відповідного приміщення. 
      Університети Третього Віку – це форма неформальної освіти дорослих, яка дозволяє літнім людям розвивати інтереси, здобувати знання та будувати соціальні зв’язки.`,
      cta: 'Приєднуйтесь до нас',
    },
    {
      id: 'plomyk',
      title: 'Полум’я надії',
      description: '10-денні освітньо-культурні візити для молоді з України.',
      image: '/images/project2.png',
      desc: `Освітньо-інтеграційні візити до Гданська для дітей та молоді з України, чиї родини постраждали від війни. Тижневі поїздки мають на меті не лише ознайомлення з історією та культурою міста, але й формування відчуття безпеки, приналежності та можливостей для майбутнього життя в Польщі.
      Програма надає молодим учасникам шанс на відпочинок від воєнної реальності та знайомство з однолітками з Польщі.`,
      cta: 'Долучайтеся до туру',
    },
    {
      id: 'staze',
      title: 'Наукові стажування у Гданську',
      description: 'Дослідницька програма з наставницьким супроводом для молодих науковців з України.',
      image: '/images/project3.jpg',
      desc: `Програма оплачуваних стажувань для молодих науковців та студентів з України, що дозволяє проводити дослідження та набувати досвіду в академічних та міських інституціях Гданська. Стажування доповнюються навчальними візитами для кращого розуміння механізмів функціонування сучасних місцевих громад.
      Програма має на меті підтримку розвитку академічної кар’єри та створення довгострокових зв’язків між науковими середовищами Польщі та України.`,
      cta: 'Подайте заявку на стажування',
    },
  ],

  partners: {
    title: 'Партнери',
    strategic: [
      { name: 'Місто Гданськ', logo: '/images/gd.png' },
      { name: 'Метрополітальний Інститут', logo: '/images/partners/metropolitalny.png' },
      { name: 'Гданський Університет', logo: '/images/ug.png' }
    ],
    network: [
      { name: 'Мігрантські НУО', logo: '/images/ngo.jpg' },
      { name: 'Школи', logo: '/images/partners/szkoly.png' },
      { name: 'Бібліотеки', logo: '/images/partners/biblioteki.png' }
    ]
  },

  mission: {
    title: 'Наша місія',
    motto: 'Ми поєднуємо науку, освіту та соціальну солідарність задля міжнародного діалогу.',
    goals: [
      {
        title: 'Дослідження та розвиток науки',
        description: 'Ми прагнемо підтримувати дослідження та проекти у сфері соціальних і гуманітарних наук, а також ефективне управління науковими фондами.',
        icon: 'FlaskConical'
      },
      {
        title: 'Підтримка освіти',
        description: 'Наша мета – підвищення якості навчання, розвиток освіти, виховання та компетенцій як у Польщі, так і за її межами.',
        icon: 'GraduationCap'
      },
      {
        title: 'Міжкультурний діалог',
        description: 'Ми прагнемо будувати дружні відносини між країнами шляхом розвитку соціальної дипломатії та культурного й мистецького обміну.',
        icon: 'Users'
      },
      {
        title: 'Міжнародна співпраця',
        description: 'Нам важливо розвивати співпрацю між освітніми закладами, організаціями, самоврядуваннями та партнерами з різних країн.',
        icon: 'Globe2'
      },
      {
        title: 'Промоція Польщі',
        description: 'Ми прагнемо поширювати польську мову, культуру, науку та спадщину системних реформ на міжнародній арені.',
        icon: 'Flag'
      },
      {
        title: 'Обмін досвідом',
        description: 'Ми хочемо ділитися польським досвідом європейської інтеграції та реформ – особливо з країнами Східного партнерства.',
        icon: 'Share2'
      },
      {
        title: 'Посилення громадянського суспільства',
        description: 'Наша місія – підтримувати самоврядування, громадянське суспільство, ринкову економіку та супутні реформи.',
        icon: 'Building'
      },
      {
        title: 'Підтримка для біженців і мігрантів',
        description: 'Ми прагнемо підтримувати біженців війни та мігрантів у їхній соціальній інтеграції та культурній адаптації в Польщі.',
        icon: 'HelpingHand'
      }
    ],

    values: [
      'Політична незалежність',
      'Культурне різноманіття',
      'Відкритість до співпраці',
      'Соціальна відповідальність'
    ]
  },

  board: {
    title: 'Члени правління',
    members: [
      {
        id: 'patryk-blawat',
        name: 'Патрик Блават',
        photo: '/images/patryk.png',
        bio: 'Засновник асоціації «Wiatr od Morza», яка з 2021 року реалізує проєкти в рамках громадського бюджету, організовує культурні заходи та популяризує знання про Гдиню. З 2024 року — депутат району Гдиня Цисова та член Гдинського комітету з реновації. Студент просторової економіки, поєднує громадську діяльність із зацікавленням у містобудуванні та місцевому розвитку.'
      },
      {
        id: 'patryk-blawat',
        name: 'Патрик Блават',
        photo: '/images/patryk.png',
        bio: 'Засновник асоціації «Wiatr od Morza», яка з 2021 року реалізує проєкти в рамках громадського бюджету, організовує культурні заходи та популяризує знання про Гдиню. З 2024 року — депутат району Гдиня Цисова та член Гдинського комітету з реновації. Студент просторової економіки, поєднує громадську діяльність із зацікавленням у містобудуванні та місцевому розвитку.'
      },
      {
        id: 'patryk-blawat',
        name: 'Патрик Блават',
        photo: '/images/patryk.png',
        bio: 'Засновник асоціації «Wiatr od Morza», яка з 2021 року реалізує проєкти в рамках громадського бюджету, організовує культурні заходи та популяризує знання про Гдиню. З 2024 року — депутат району Гдиня Цисова та член Гдинського комітету з реновації. Студент просторової економіки, поєднує громадську діяльність із зацікавленням у містобудуванні та місцевому розвитку.'
      }
    ]
  },

  contact: {
    title: 'Контактна форма',
    name: 'Ім’я',
    surname: 'Прізвище',
    email: 'E-mail',
    phone: 'Телефон',
    topic: 'Тема',
    topicPlaceholder: 'Виберіть тему...',
    topicContact: 'Загальний контакт',
    topicProject: 'Заявка на проект',
    project: 'Виберіть проект',
    projectPlaceholder: 'Виберіть проект...',
    projectUni: 'Університет ІІІ Віку',
    projectPlomyk: 'Полум’я надії',
    projectIntern: 'Наукові стажування',
    message: 'Повідомлення',
    rodo1: 'Я погоджуюсь на обробку моїх персональних даних з метою контакту.',
    rodo2: 'Підтверджую ознайомлення з політикою конфіденційності.',
    submit: 'Надіслати',
    confirmation: 'Дякуємо за відправку форми!'
  },
  footer: {
    logoTitle: 'Фундація ISEF',
    logoText: 'INTERNATIONAL SCIENTIFIC AND EDUCATIONAL FORUM',
    contactTitle: 'Контактні дані',
    addressLabel: 'Адреса',
    address: 'вул. Яна Гевелія 11/811, 80-890 Гданськ',
    krs: '0001162327',
    nip: '5835533208',
    regon: '54121717200000',
    navTitle: 'Навігація',
    socialTitle: 'Ми в соцмережах',
    copy: 'Фундація. Усі права захищені.'
  },

  news: [
    {
      title: 'Культурні майстер-класи для молоді з України',
      text: '2 серпня 2025 року відбулися унікальні інтеграційні майстер-класи, у яких взяли участь понад 40 молодих людей з Польщі та України. Програма включала зустрічі з місцевими митцями, вивчення польської мови та творчі заняття. Завдяки підтримці партнерів вдалося створити простір для міжкультурного діалогу та побудови нових дружніх стосунків.',
      image: '/images/project1.jpg',
      date: '02.08.2025'
    },
    {
      title: 'Фундація розпочинає новий проєкт "Міст поколінь"',
      text: 'Проєкт "Міст поколінь" має на меті об’єднати старше покоління з молоддю через серію зустрічей, спільну творчу діяльність і майстер-класи. Урочисте відкриття відбулося 10 серпня 2025 року в Гданську. Учасники могли спробувати себе в живописі, фотографії та традиційних ремеслах. Це лише початок серії заходів, які проходитимуть щомісяця.',
      image: '/images/project1.jpg',
      date: '10.08.2025'
    },
    {
      title: 'Благодійний концерт на підтримку молодих талантів',
      text: '20 серпня 2025 року ми організували благодійний концерт у центрі Гданська, під час якого виступили молоді артисти з регіону. Усі зібрані кошти були спрямовані на стипендії для талановитої молоді з неблагополучних середовищ. Завдяки підтримці мешканців вдалося зібрати понад 50 000 злотих!',
      image: '/images/project1.jpg',
      date: '20.08.2025'
    }
  ]

}
